{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 17,
      "special": true,
      "content": "[END]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 18,
      "special": true,
      "content": "?",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 19,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 20,
      "special": false,
      "content": "00",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 21,
      "special": false,
      "content": "01",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 22,
      "special": false,
      "content": "02",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 23,
      "special": false,
      "content": "03",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 24,
      "special": false,
      "content": "04",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 25,
      "special": false,
      "content": "05",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 26,
      "special": false,
      "content": "06",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 27,
      "special": false,
      "content": "07",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 28,
      "special": false,
      "content": "08",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 29,
      "special": false,
      "content": "09",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 30,
      "special": false,
      "content": "10",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 31,
      "special": false,
      "content": "11",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 32,
      "special": false,
      "content": "12",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 33,
      "special": false,
      "content": "13",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 34,
      "special": false,
      "content": "14",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 35,
      "special": false,
      "content": "15",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 36,
      "special": false,
      "content": "16",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 37,
      "special": false,
      "content": "17",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 38,
      "special": false,
      "content": "18",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 39,
      "special": false,
      "content": "19",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 40,
      "special": false,
      "content": "20",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 41,
      "special": false,
      "content": "21",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 42,
      "special": false,
      "content": "22",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 43,
      "special": false,
      "content": "23",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 44,
      "special": false,
      "content": "24",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 45,
      "special": false,
      "content": "25",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 46,
      "special": false,
      "content": "26",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 47,
      "special": false,
      "content": "27",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 48,
      "special": false,
      "content": "28",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 49,
      "special": false,
      "content": "29",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 50,
      "special": false,
      "content": "30",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 51,
      "special": false,
      "content": "31",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 52,
      "special": false,
      "content": "32",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 53,
      "special": false,
      "content": "33",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 54,
      "special": false,
      "content": "34",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 55,
      "special": false,
      "content": "35",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 56,
      "special": false,
      "content": "36",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 57,
      "special": false,
      "content": "37",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 58,
      "special": false,
      "content": "38",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 59,
      "special": false,
      "content": "39",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 60,
      "special": false,
      "content": "40",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 61,
      "special": false,
      "content": "41",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 62,
      "special": false,
      "content": "42",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 63,
      "special": false,
      "content": "43",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 64,
      "special": false,
      "content": "44",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 65,
      "special": false,
      "content": "45",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 66,
      "special": false,
      "content": "46",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 67,
      "special": false,
      "content": "47",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 68,
      "special": false,
      "content": "48",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 69,
      "special": false,
      "content": "49",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 70,
      "special": false,
      "content": "50",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 71,
      "special": false,
      "content": "51",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 72,
      "special": false,
      "content": "52",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 73,
      "special": false,
      "content": "53",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 74,
      "special": false,
      "content": "54",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 75,
      "special": false,
      "content": "55",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 76,
      "special": false,
      "content": "56",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 77,
      "special": false,
      "content": "57",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 78,
      "special": false,
      "content": "58",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 79,
      "special": false,
      "content": "59",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 80,
      "special": false,
      "content": "60",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 81,
      "special": false,
      "content": "61",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 82,
      "special": false,
      "content": "62",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 83,
      "special": false,
      "content": "63",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 84,
      "special": false,
      "content": "64",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 85,
      "special": false,
      "content": "65",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 86,
      "special": false,
      "content": "66",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 87,
      "special": false,
      "content": "67",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 88,
      "special": false,
      "content": "68",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 89,
      "special": false,
      "content": "69",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 90,
      "special": false,
      "content": "70",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 91,
      "special": false,
      "content": "71",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 92,
      "special": false,
      "content": "72",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 93,
      "special": false,
      "content": "73",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 94,
      "special": false,
      "content": "74",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 95,
      "special": false,
      "content": "75",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 96,
      "special": false,
      "content": "76",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 97,
      "special": false,
      "content": "77",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 98,
      "special": false,
      "content": "78",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 99,
      "special": false,
      "content": "79",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 100,
      "special": false,
      "content": "80",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 101,
      "special": false,
      "content": "81",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 102,
      "special": false,
      "content": "82",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 103,
      "special": false,
      "content": "83",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 104,
      "special": false,
      "content": "84",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 105,
      "special": false,
      "content": "85",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 106,
      "special": false,
      "content": "86",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 107,
      "special": false,
      "content": "87",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 108,
      "special": false,
      "content": "88",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 109,
      "special": false,
      "content": "89",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 110,
      "special": false,
      "content": "90",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 111,
      "special": false,
      "content": "91",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 112,
      "special": false,
      "content": "92",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 113,
      "special": false,
      "content": "93",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 114,
      "special": false,
      "content": "94",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 115,
      "special": false,
      "content": "95",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 116,
      "special": false,
      "content": "96",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 117,
      "special": false,
      "content": "97",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 118,
      "special": false,
      "content": "98",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 119,
      "special": false,
      "content": "99",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 120,
      "special": false,
      "content": "'sys0':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 121,
      "special": false,
      "content": "'sys1':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 122,
      "special": false,
      "content": "'sys2':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 123,
      "special": false,
      "content": "'sys3':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 124,
      "special": false,
      "content": "'sys4':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 125,
      "special": false,
      "content": "'num_sys':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 126,
      "special": false,
      "content": "'params':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 127,
      "special": false,
      "content": "'data':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 128,
      "special": false,
      "content": "'description':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 129,
      "special": false,
      "content": "'step_size':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 130,
      "special": false,
      "content": "'init_point':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 131,
      "special": false,
      "content": "'step_multip':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 132,
      "special": false,
      "content": "'name':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 133,
      "special": false,
      "content": "'lorenz'",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 134,
      "special": false,
      "content": "'normalization':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 135,
      "special": false,
      "content": "'embedding':",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 136,
      "special": false,
      "content": "000",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 137,
      "special": false,
      "content": "0000",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 138,
      "special": false,
      "content": "e-05",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 139,
      "special": false,
      "content": "e-06",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 140,
      "special": false,
      "content": "e-07",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 141,
      "special": false,
      "content": "e-08",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "2": 2,
      "3": 3,
      "4": 4,
      "5": 5,
      "6": 6,
      "7": 7,
      "8": 8,
      "9": 9,
      "{": 10,
      "}": 11,
      "[": 12,
      "]": 13,
      ",": 14,
      ".": 15,
      "-": 16
    },
    "merges": []
  }
}