{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[END]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "?",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[END]": 0,
      "?": 1,
      "[PAD]": 2,
      "'": 3,
      ",": 4,
      "-": 5,
      ".": 6,
      "0": 7,
      "1": 8,
      "2": 9,
      "3": 10,
      "4": 11,
      "5": 12,
      "6": 13,
      "7": 14,
      "8": 15,
      "9": 16,
      ":": 17,
      "[": 18,
      "]": 19,
      "_": 20,
      "a": 21,
      "b": 22,
      "c": 23,
      "d": 24,
      "e": 25,
      "g": 26,
      "i": 27,
      "l": 28,
      "m": 29,
      "n": 30,
      "o": 31,
      "p": 32,
      "r": 33,
      "s": 34,
      "t": 35,
      "u": 36,
      "y": 37,
      "z": 38,
      "{": 39,
      "}": 40,
      "Ċ": 41,
      "Ġ": 42,
      "Ġ-": 43,
      "Ġ0": 44,
      "Ġ[": 45,
      "],": 46,
      "Ġ1": 47,
      "Ġ[-": 48,
      "':": 49,
      "Ġ'": 50,
      "Ġ2": 51,
      "16": 52,
      "25": 53,
      "14": 54,
      "06": 55,
      "05": 56,
      "13": 57,
      "15": 58,
      "03": 59,
      "12": 60,
      "17": 61,
      "04": 62,
      "07": 63,
      "23": 64,
      "18": 65,
      "08": 66,
      "27": 67,
      "44": 68,
      "26": 69,
      "19": 70,
      "28": 71,
      "24": 72,
      "Ġ3": 73,
      "09": 74,
      "34": 75,
      "36": 76,
      "56": 77,
      "38": 78,
      "29": 79,
      "75": 80,
      "35": 81,
      "47": 82,
      "45": 83,
      "66": 84,
      "37": 85,
      "39": 86,
      "48": 87,
      "55": 88,
      "46": 89,
      "22": 90,
      "Ġ4": 91,
      "78": 92,
      "11": 93,
      "33": 94,
      "88": 95,
      "95": 96,
      "02": 97,
      "77": 98,
      "94": 99,
      "Ġ[[": 100,
      "in": 101,
      "96": 102,
      "Ġ7": 103,
      "58": 104,
      "97": 105,
      "98": 106,
      "ti": 107,
      "{'": 108,
      "Ġ5": 109,
      "76": 110,
      "86": 111,
      "Ġ6": 112,
      "]]": 113,
      "am": 114,
      "ep": 115,
      "st": 116,
      "step": 117,
      "00": 118,
      "54": 119,
      "32": 120,
      "57": 121,
      "84": 122,
      "53": 123,
      "93": 124,
      "iz": 125,
      "or": 126,
      "sy": 127,
      "},": 128,
      "Ġ{'": 129,
      "sys": 130,
      "74": 131,
      "21": 132,
      "64": 133,
      "10": 134,
      "92": 135,
      "73": 136,
      "Ġ8": 137,
      "68": 138,
      "72": 139,
      "01": 140,
      "31": 141,
      "52": 142,
      "]],": 143,
      "on": 144,
      "tion": 145,
      "49": 146,
      "42": 147,
      "62": 148,
      "43": 149,
      "59": 150,
      "67": 151,
      "69": 152,
      "65": 153,
      "83": 154,
      "87": 155,
      "Ġ10": 156,
      "Ġ[[-": 157,
      "85": 158,
      "',": 159,
      "ar": 160,
      "en": 161,
      "it": 162,
      "lti": 163,
      "lor": 164,
      "mu": 165,
      "nam": 166,
      "oin": 167,
      "par": 168,
      "poin": 169,
      "siz": 170,
      "init": 171,
      "Ġ700": 172,
      "ams": 173,
      "enz": 174,
      "ltip": 175,
      "lorenz": 176,
      "multip": 177,
      "name": 178,
      "params": 179,
      "point": 180,
      "size": 181,
      "Ġ9": 182,
      "89": 183,
      "61": 184,
      "99": 185,
      "82": 186,
      "51": 187,
      "41": 188,
      "63": 189,
      "79": 190,
      "81": 191,
      "20": 192,
      "]},": 193,
      "al": 194,
      "at": 195,
      "ation": 196,
      "be": 197,
      "cr": 198,
      "dd": 199,
      "de": 200,
      "dat": 201,
      "em": 202,
      "ip": 203,
      "mal": 204,
      "nu": 205,
      "nor": 206,
      "scr": 207,
      "Ġ[[[": 208,
      "ing": 209,
      "]]}": 210,
      "]]]},": 211,
      "ization": 212,
      "bedd": 213,
      "descr": 214,
      "data": 215,
      "embedd": 216,
      "iption": 217,
      "malization": 218,
      "num": 219,
      "normalization": 220,
      "description": 221,
      "embedding": 222,
      "Ġ11": 223,
      "71": 224,
      "Ġ12": 225,
      "91": 226,
      "Ġ16": 227,
      "30": 228,
      "Ġ13": 229,
      "016": 230,
      "Ġ14": 231,
      "Ġ15": 232,
      "125": 233,
      "055": 234,
      "40": 235,
      "086": 236,
      "Ġ17": 237,
      "305": 238,
      "336": 239,
      "164": 240,
      "004": 241,
      "023": 242,
      "445": 243,
      "027": 244,
      "195": 245,
      "105": 246,
      "035": 247,
      "375": 248,
      "Ġ18": 249,
      "Ġ32": 250,
      "117": 251,
      "Ġ19": 252,
      "113": 253,
      "045": 254,
      "414": 255,
      "234": 256,
      "266": 257,
      "Ġ20": 258,
      "074": 259,
      "025": 260,
      "008": 261,
      "006": 262,
      "047": 263,
      "Ġ21": 264,
      "Ġ100": 265,
      "115": 266,
      "094": 267,
      "062": 268,
      "516": 269,
      "014": 270,
      "50": 271,
      "Ġ22": 272,
      "137": 273,
      "484": 274,
      "625": 275,
      "043": 276,
      "066": 277,
      "215": 278,
      "555": 279,
      "227": 280,
      "Ġ23": 281,
      "Ġ24": 282,
      "037": 283,
      "145": 284,
      "184": 285,
      "695": 286,
      "188": 287,
      "098": 288,
      "254": 289,
      "104": 290,
      "017": 291,
      "076": 292,
      "026": 293,
      "Ġ25": 294,
      "176": 295,
      "133": 296,
      "223": 297,
      "084": 298,
      "586": 299,
      "836": 300,
      "203": 301,
      "324": 302,
      "107": 303,
      "766": 304,
      "018": 305,
      "805": 306,
      "096": 307,
      "007": 308,
      "246": 309,
      "Ġ26": 310,
      "297": 311,
      "207": 312,
      "285": 313,
      "984": 314,
      "875": 315,
      "293": 316,
      "013": 317,
      "344": 318,
      "734": 319,
      "156": 320,
      "Ġ27": 321,
      "103": 322,
      "914": 323,
      "064": 324,
      "664": 325,
      "003": 326,
      "205": 327,
      "012": 328,
      "114": 329,
      "562": 330,
      "434": 331,
      "015": 332,
      "Ġ[[[-": 333,
      "438": 334,
      "123": 335,
      "396": 336,
      "426": 337,
      "328": 338,
      "945": 339,
      "418": 340,
      "046": 341,
      "316": 342,
      "116": 343,
      "Ġ28": 344,
      "186": 345,
      "127": 346,
      "108": 347,
      "005": 348,
      "258": 349,
      "229": 350,
      "028": 351,
      "217": 352,
      "106": 353,
      "527": 354,
      "019": 355,
      "338": 356,
      "355": 357,
      "363": 358,
      "264": 359,
      "036": 360,
      "119": 361,
      "152": 362,
      "244": 363,
      "044": 364,
      "566": 365,
      "354": 366,
      "406": 367,
      "Ġ29": 368,
      "029": 369,
      "367": 370,
      "009": 371,
      "135": 372,
      "277": 373,
      "024": 374,
      "124": 375,
      "645": 376,
      "508": 377,
      "118": 378,
      "225": 379,
      "395": 380,
      "547": 381,
      "465": 382,
      "109": 383,
      "219": 384,
      "543": 385,
      "598": 386,
      "Ġ30": 387,
      "334": 388,
      "387": 389,
      "275": 390,
      "973": 391,
      "496": 392,
      "048": 393,
      "574": 394,
      "168": 395,
      "033": 396,
      "146": 397,
      "633": 398,
      "Ġ31": 399,
      "617": 400,
      "637": 401,
      "082": 402,
      "777": 403,
      "676": 404,
      "715": 405,
      "383": 406,
      "656": 407,
      "053": 408,
      "095": 409,
      "174": 410,
      "112": 411,
      "283": 412,
      "357": 413,
      "154": 414,
      "075": 415,
      "477": 416,
      "416": 417,
      "056": 418,
      "Ġ33": 419,
      "754": 420,
      "057": 421,
      "564": 422,
      "326": 423,
      "824": 424,
      "242": 425,
      "287": 426,
      "688": 427,
      "723": 428,
      "668": 429,
      "314": 430,
      "957": 431,
      "Ġ34": 432,
      "097": 433,
      "088": 434,
      "457": 435,
      "213": 436,
      "054": 437,
      "087": 438,
      "307": 439,
      "058": 440,
      "473": 441,
      "049": 442,
      "126": 443,
      "197": 444,
      "758": 445,
      "216": 446,
      "273": 447,
      "214": 448,
      "038": 449,
      "323": 450,
      "453": 451,
      "535": 452,
      "085": 453,
      "295": 454,
      "143": 455,
      "906": 456,
      "965": 457,
      "506": 458,
      "274": 459,
      "034": 460,
      "256": 461,
      "193": 462,
      "504": 463,
      "059": 464,
      "797": 465,
      "523": 466,
      "373": 467,
      "312": 468,
      "582": 469,
      "102": 470,
      "Ġ35": 471,
      "785": 472,
      "934": 473,
      "337": 474,
      "226": 475,
      "348": 476,
      "844": 477,
      "077": 478,
      "092": 479,
      "206": 480,
      "537": 481,
      "848": 482,
      "093": 483,
      "111": 484,
      "545": 485,
      "Ġ36": 486,
      "365": 487,
      "918": 488,
      "294": 489,
      "605": 490,
      "332": 491,
      "078": 492,
      "613": 493,
      "883": 494,
      "594": 495,
      "563": 496,
      "Ġ37": 497,
      "157": 498,
      "578": 499
    },
    "merges": [
      "Ġ -",
      "Ġ 0",
      "Ġ [",
      "] ,",
      "Ġ 1",
      "Ġ[ -",
      "' :",
      "Ġ '",
      "Ġ 2",
      "1 6",
      "2 5",
      "1 4",
      "0 6",
      "0 5",
      "1 3",
      "1 5",
      "0 3",
      "1 2",
      "1 7",
      "0 4",
      "0 7",
      "2 3",
      "1 8",
      "0 8",
      "2 7",
      "4 4",
      "2 6",
      "1 9",
      "2 8",
      "2 4",
      "Ġ 3",
      "0 9",
      "3 4",
      "3 6",
      "5 6",
      "3 8",
      "2 9",
      "7 5",
      "3 5",
      "4 7",
      "4 5",
      "6 6",
      "3 7",
      "3 9",
      "4 8",
      "5 5",
      "4 6",
      "2 2",
      "Ġ 4",
      "7 8",
      "1 1",
      "3 3",
      "8 8",
      "9 5",
      "0 2",
      "7 7",
      "9 4",
      "Ġ[ [",
      "i n",
      "9 6",
      "Ġ 7",
      "5 8",
      "9 7",
      "9 8",
      "t i",
      "{ '",
      "Ġ 5",
      "7 6",
      "8 6",
      "Ġ 6",
      "] ]",
      "a m",
      "e p",
      "s t",
      "st ep",
      "0 0",
      "5 4",
      "3 2",
      "5 7",
      "8 4",
      "5 3",
      "9 3",
      "i z",
      "o r",
      "s y",
      "} ,",
      "Ġ {'",
      "sy s",
      "7 4",
      "2 1",
      "6 4",
      "1 0",
      "9 2",
      "7 3",
      "Ġ 8",
      "6 8",
      "7 2",
      "0 1",
      "3 1",
      "5 2",
      "] ],",
      "o n",
      "ti on",
      "4 9",
      "4 2",
      "6 2",
      "4 3",
      "5 9",
      "6 7",
      "6 9",
      "6 5",
      "8 3",
      "8 7",
      "Ġ1 0",
      "Ġ[[ -",
      "8 5",
      "' ,",
      "a r",
      "e n",
      "i t",
      "l ti",
      "l or",
      "m u",
      "n am",
      "o in",
      "p ar",
      "p oin",
      "s iz",
      "in it",
      "Ġ7 00",
      "am s",
      "en z",
      "lti p",
      "lor enz",
      "mu ltip",
      "nam e",
      "par ams",
      "poin t",
      "siz e",
      "Ġ 9",
      "8 9",
      "6 1",
      "9 9",
      "8 2",
      "5 1",
      "4 1",
      "6 3",
      "7 9",
      "8 1",
      "2 0",
      "] },",
      "a l",
      "a t",
      "a tion",
      "b e",
      "c r",
      "d d",
      "d e",
      "d at",
      "e m",
      "i p",
      "m al",
      "n u",
      "n or",
      "s cr",
      "Ġ[[ [",
      "in g",
      "]] }",
      "]] ]},",
      "iz ation",
      "be dd",
      "de scr",
      "dat a",
      "em bedd",
      "ip tion",
      "mal ization",
      "nu m",
      "nor malization",
      "descr iption",
      "embedd ing",
      "Ġ1 1",
      "7 1",
      "Ġ1 2",
      "9 1",
      "Ġ1 6",
      "3 0",
      "Ġ1 3",
      "0 16",
      "Ġ1 4",
      "Ġ1 5",
      "1 25",
      "05 5",
      "4 0",
      "08 6",
      "Ġ1 7",
      "3 05",
      "3 36",
      "16 4",
      "0 04",
      "0 23",
      "44 5",
      "0 27",
      "19 5",
      "1 05",
      "03 5",
      "3 75",
      "Ġ1 8",
      "Ġ3 2",
      "1 17",
      "Ġ1 9",
      "1 13",
      "04 5",
      "4 14",
      "23 4",
      "26 6",
      "Ġ2 0",
      "07 4",
      "0 25",
      "0 08",
      "0 06",
      "04 7",
      "Ġ2 1",
      "Ġ1 00",
      "1 15",
      "09 4",
      "06 2",
      "5 16",
      "0 14",
      "5 0",
      "Ġ2 2",
      "13 7",
      "48 4",
      "6 25",
      "04 3",
      "06 6",
      "2 15",
      "55 5",
      "2 27",
      "Ġ2 3",
      "Ġ2 4",
      "03 7",
      "14 5",
      "18 4",
      "6 95",
      "18 8",
      "09 8",
      "25 4",
      "1 04",
      "0 17",
      "07 6",
      "0 26",
      "Ġ2 5",
      "17 6",
      "13 3",
      "2 23",
      "08 4",
      "58 6",
      "8 36",
      "2 03",
      "3 24",
      "1 07",
      "7 66",
      "0 18",
      "8 05",
      "09 6",
      "0 07",
      "24 6",
      "Ġ2 6",
      "29 7",
      "2 07",
      "28 5",
      "98 4",
      "8 75",
      "29 3",
      "0 13",
      "3 44",
      "7 34",
      "15 6",
      "Ġ2 7",
      "1 03",
      "9 14",
      "06 4",
      "66 4",
      "0 03",
      "2 05",
      "0 12",
      "1 14",
      "56 2",
      "4 34",
      "0 15",
      "Ġ[[[ -",
      "4 38",
      "12 3",
      "39 6",
      "4 26",
      "3 28",
      "9 45",
      "4 18",
      "04 6",
      "3 16",
      "1 16",
      "Ġ2 8",
      "18 6",
      "12 7",
      "1 08",
      "0 05",
      "25 8",
      "2 29",
      "0 28",
      "2 17",
      "1 06",
      "5 27",
      "0 19",
      "3 38",
      "35 5",
      "36 3",
      "26 4",
      "03 6",
      "1 19",
      "15 2",
      "2 44",
      "04 4",
      "56 6",
      "35 4",
      "4 06",
      "Ġ2 9",
      "0 29",
      "36 7",
      "0 09",
      "13 5",
      "27 7",
      "0 24",
      "12 4",
      "6 45",
      "5 08",
      "1 18",
      "2 25",
      "39 5",
      "5 47",
      "46 5",
      "1 09",
      "2 19",
      "54 3",
      "5 98",
      "Ġ3 0",
      "3 34",
      "38 7",
      "27 5",
      "97 3",
      "4 96",
      "04 8",
      "57 4",
      "16 8",
      "03 3",
      "14 6",
      "6 33",
      "Ġ3 1",
      "6 17",
      "6 37",
      "08 2",
      "77 7",
      "6 76",
      "7 15",
      "38 3",
      "6 56",
      "05 3",
      "09 5",
      "17 4",
      "1 12",
      "28 3",
      "35 7",
      "15 4",
      "07 5",
      "47 7",
      "4 16",
      "05 6",
      "Ġ3 3",
      "75 4",
      "05 7",
      "56 4",
      "3 26",
      "8 24",
      "24 2",
      "28 7",
      "6 88",
      "7 23",
      "66 8",
      "3 14",
      "95 7",
      "Ġ3 4",
      "09 7",
      "08 8",
      "45 7",
      "2 13",
      "05 4",
      "08 7",
      "3 07",
      "05 8",
      "47 3",
      "04 9",
      "12 6",
      "19 7",
      "75 8",
      "2 16",
      "27 3",
      "2 14",
      "03 8",
      "3 23",
      "45 3",
      "5 35",
      "08 5",
      "29 5",
      "14 3",
      "9 06",
      "96 5",
      "5 06",
      "27 4",
      "03 4",
      "25 6",
      "19 3",
      "5 04",
      "05 9",
      "7 97",
      "5 23",
      "37 3",
      "3 12",
      "58 2",
      "1 02",
      "Ġ3 5",
      "78 5",
      "9 34",
      "3 37",
      "2 26",
      "34 8",
      "8 44",
      "07 7",
      "09 2",
      "2 06",
      "5 37",
      "8 48",
      "09 3",
      "11 1",
      "5 45",
      "Ġ3 6",
      "36 5",
      "9 18",
      "29 4",
      "6 05",
      "33 2",
      "07 8",
      "6 13",
      "88 3",
      "5 94",
      "56 3",
      "Ġ3 7",
      "15 7",
      "5 78"
    ]
  }
}